coocox/Mplib/Toshaba/TPMP341/cmsis_lib/lib/cmsis_boot/startup/iar/startup_TMPM341.s
                PUBWEAK INTPHT01_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTPHT01_IRQHandler
                B       INTPHT01_IRQHandler

                PUBWEAK INTPHT10_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTPHT10_IRQHandler
                B       INTPHT10_IRQHandler

                PUBWEAK INTPHT11_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTPHT11_IRQHandler
                B       INTPHT11_IRQHandler

                PUBWEAK INTPHT20_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTPHT20_IRQHandler
                B       INTPHT20_IRQHandler

                PUBWEAK INTPHT21_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTPHT21_IRQHandler
                B       INTPHT21_IRQHandler

                PUBWEAK INTPHT30_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTPHT30_IRQHandler
                B       INTPHT30_IRQHandler

                PUBWEAK INTPHT31_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTPHT31_IRQHandler
                B       INTPHT31_IRQHandler

                PUBWEAK INTPHEVRY0_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTPHEVRY0_IRQHandler
                B       INTPHEVRY0_IRQHandler

                PUBWEAK INTPHEVRY1_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTPHEVRY1_IRQHandler
                B       INTPHEVRY1_IRQHandler

                PUBWEAK INTPHEVRY2_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTPHEVRY2_IRQHandler
                B       INTPHEVRY2_IRQHandler

                PUBWEAK INTPHEVRY3_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTPHEVRY3_IRQHandler
                B       INTPHEVRY3_IRQHandler

                PUBWEAK INTRX3_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTRX3_IRQHandler
                B       INTRX3_IRQHandler

                PUBWEAK INTTX3_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTTX3_IRQHandler
                B       INTTX3_IRQHandler

                PUBWEAK INTRX4_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTRX4_IRQHandler
                B       INTRX4_IRQHandler

                PUBWEAK INTTX4_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTTX4_IRQHandler
                B       INTTX4_IRQHandler

                PUBWEAK INTCAP00_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTCAP00_IRQHandler 
                B       INTCAP00_IRQHandler 

                PUBWEAK INTCAP01_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTCAP01_IRQHandler 
                B       INTCAP01_IRQHandler 

                PUBWEAK INTCAP10_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTCAP10_IRQHandler
                B       INTCAP10_IRQHandler

                PUBWEAK INTCAP11_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTCAP11_IRQHandler
                B       INTCAP11_IRQHandler

                PUBWEAK INTCAP20_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTCAP20_IRQHandler
                B       INTCAP20_IRQHandler

                PUBWEAK INTCAP21_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTCAP21_IRQHandler
                B       INTCAP21_IRQHandler

                PUBWEAK INTCAP30_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTCAP30_IRQHandler
                B       INTCAP30_IRQHandler

                PUBWEAK INTCAP31_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTCAP31_IRQHandler
                B       INTCAP31_IRQHandler

                PUBWEAK INTCAP40_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTCAP40_IRQHandler
                B       INTCAP40_IRQHandler

                PUBWEAK INTCAP41_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTCAP41_IRQHandler
                B       INTCAP41_IRQHandler

                PUBWEAK INTCAP50_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTCAP50_IRQHandler
                B       INTCAP50_IRQHandler

                PUBWEAK INTCAP51_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTCAP51_IRQHandler
                B       INTCAP51_IRQHandler

                PUBWEAK INTCAP60_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTCAP60_IRQHandler
                B       INTCAP60_IRQHandler

                PUBWEAK INTCAP61_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTCAP61_IRQHandler
                B       INTCAP61_IRQHandler

                PUBWEAK INTCAP70_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTCAP70_IRQHandler
                B       INTCAP70_IRQHandler

                PUBWEAK INTCAP71_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTCAP71_IRQHandler
                B       INTCAP71_IRQHandler

                PUBWEAK INTCAP80_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAP80_IRQHandler
                B       INTCAP80_IRQHandler

                PUBWEAK INTCAP81_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAP81_IRQHandler
                B       INTCAP81_IRQHandler

                PUBWEAK INTCAP90_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTCAP90_IRQHandler
                B       INTCAP90_IRQHandler

                PUBWEAK INTCAP91_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAP91_IRQHandler
                B       INTCAP91_IRQHandler

                PUBWEAK INT8_IRQHandler
                SECTION .text:CODE:REORDER(1)
INT8_IRQHandler
                B       INT8_IRQHandler

                PUBWEAK INT9_IRQHandler
                SECTION .text:CODE:REORDER(1)
INT9_IRQHandler
                B       INT9_IRQHandler

                PUBWEAK INTA_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTA_IRQHandler
                B       INTA_IRQHandler

                PUBWEAK INTB_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTB_IRQHandler
                B       INTB_IRQHandler

                PUBWEAK INTDMAC0TC_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMAC0TC_IRQHandler
                B       INTDMAC0TC_IRQHandler

                PUBWEAK INTDMAC1TC_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMAC1TC_IRQHandler
                B       INTDMAC1TC_IRQHandler

                PUBWEAK INTDMAC0ERR_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMAC0ERR_IRQHandler
                B       INTDMAC0ERR_IRQHandler

                PUBWEAK INTDMAC1ERR_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMAC1ERR_IRQHandler
                B       INTDMAC1ERR_IRQHandler

                PUBWEAK INTSSP_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTSSP_IRQHandler
                B       INTSSP_IRQHandler

                END
